{
  "backend/main.mo": "Defines an empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Contains feature evidence metadata listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries of numerous frontend source files for reference.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Base HTML document loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main app component handling page navigation and rendering localized headers and footers.",
  "frontend/src/features/cashregister/CashClosePanel.tsx": "UI panel for closing a cash register session with payment breakdown and totals.",
  "frontend/src/features/cashregister/CashOpenPanel.tsx": "UI panel for opening a cash register session by entering an initial float amount.",
  "frontend/src/features/cashregister/ClosingsHistoryList.tsx": "Displays a list of past cash register closings with totals and payment method breakdowns.",
  "frontend/src/features/cashregister/reporting.ts": "Utility functions for computing payment breakdowns and filtering sales by cash session.",
  "frontend/src/features/customers/CustomerDetail.tsx": "Displays a customer's details and their filtered purchase history with totals and item breakdowns.",
  "frontend/src/features/customers/CustomerFormDialog.tsx": "Provides a dialog form to create or edit a customer, handling name, phone, and submission state.",
  "frontend/src/features/customers/CustomersList.tsx": "Renders a table of customers with actions to view, edit, or delete each entry.",
  "frontend/src/features/inventory/ProductFilters.tsx": "Offers search and category filter controls for products, updating values via callbacks.",
  "frontend/src/features/inventory/ProductFormDialog.tsx": "Dialog for creating or editing a product with fields for name, category, pricing, stock, and image upload.",
  "frontend/src/features/inventory/ProductTable.tsx": "Displays product rows with image, category, price, stock warnings, and edit/delete actions.",
  "frontend/src/features/pos/CartPanel.tsx": "Shows cart items with quantity controls, per-item subtotals, removal actions, and a total summary.",
  "frontend/src/features/pos/cartTypes.ts": "Defines cart item structures and helpers for computing subtotals, totals, and converting items to sale items.",
  "frontend/src/features/pos/CheckoutPanel.tsx": "Checkout form handling payment method selection, cash validation, change calculation, and finalizing a sale.",
  "frontend/src/features/pos/CustomerSelector.tsx": "Dropdown component for selecting or clearing an optional linked customer.",
  "frontend/src/features/pos/payment.ts": "Payment utilities including methods list, cash validation, change calculation, and label helpers.",
  "frontend/src/features/pos/ProductPicker.tsx": "Product search and filtering UI that lists products and allows adding them to the cart.",
  "frontend/src/features/pos/RaffleEligibilityAlert.tsx": "Displays a raffle eligibility alert when the purchase total exceeds a threshold.",
  "frontend/src/features/pos/useCart.ts": "Custom cart hook managing cart items, validation, stock checks, and total calculation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and refreshes a backend actor based on Internet Identity and invalidates dependent queries.",
  "frontend/src/hooks/useAppStore.ts": "Zustand store managing products, customers, sales, and cash sessions with persistence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing authentication, identity loading, and login state.",
  "frontend/src/i18n/ptBR.ts": "Provides all pt-BR localization strings and dynamic messages for the app, covering navigation, inventory, POS, customers, and cash register.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light/dark themes, plus global styles and transitions.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/CashRegisterPage.tsx": "Implements the cash register UI, enabling opening/closing sessions and showing closing history.",
  "frontend/src/pages/CustomersPage.tsx": "Manages customer CRUD, viewing details, and prevents deletion when purchase history exists.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with navigation cards for inventory, POS, customers, and cash register.",
  "frontend/src/pages/InventoryPage.tsx": "Handles product CRUD with search and category filtering, rendering product lists and dialogs.",
  "frontend/src/pages/PosPage.tsx": "Implements the POS workflow including cart handling, checkout, customer selection, and sale completion.",
  "frontend/src/storage/localStorageStore.ts": "Loads, saves, and clears app state in localStorage with versioning and default-state fallback.",
  "frontend/src/types/domain.ts": "Defines domain types for products, customers, sales, cash sessions, and overall app state.",
  "frontend/src/utils/image.ts": "Provides a function to validate image files under 500KB and convert them to base64 using FileReader.",
  "frontend/src/utils/money.ts": "Formats numbers as BRL currency and parses currency strings back into numeric values.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended color system, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including summary, architecture notes, features, and versioning state for the SPA mini-market app."
}