{
  "backend/main.mo": "Main actor implementing a mini market POS system with customer management, inventory, sales tracking, cash register sessions, raffle eligibility logic, user profiles, and authorization/storage mixins. Supports three payment methods: pix, debito, and credito.",
  "backend/migration.mo": "Migration module that converts old sales data with payment methods (cash, card) to new payment methods (pix, debito, credito) by defaulting all old sales to pix during upgrade.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: fixing payment method mapping in mappers.ts, updating sales report grouping logic, and adding payment method confirmation display in CheckoutPanel.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/TSX files covering domain types, state management, UI components, POS flow, customer management, inventory, cash register, and reporting features with Portuguese localization.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point for the Mini Market Manager React application with basic meta tags and root div mounting point.",
  "frontend/PERFORMANCE_IMPROVEMENTS_REPORT.md": "Performance optimization report detailing authentication system implementation with Internet Identity, render optimizations using useCallback/useMemo across pages, and elimination of unauthorized backend calls.",
  "frontend/src/App.tsx": "Main application component that manages page navigation, authentication state, and renders the header, footer, and current page (dashboard, inventory, POS, customers, cash register, or sales history).",
  "frontend/src/backend/mappers.ts": "Provides mapping utilities to convert between frontend domain models and backend types, including currency conversion (BRL to cents), payment methods, sale items, customers, sales, and cash register sessions.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper component that shows a loading screen during initialization, login page if unauthenticated, or renders children if authenticated.",
  "frontend/src/components/auth/AuthInitializingScreen.tsx": "Loading screen component displayed while the authentication system initializes, showing a shopping bag icon and spinner.",
  "frontend/src/features/cashregister/CashClosePanel.tsx": "Panel component for closing a cash register session, displaying initial float, sales breakdown by payment method, grand total, and a close button.",
  "frontend/src/features/cashregister/CashOpenPanel.tsx": "Panel component for opening a new cash register session with an input field for the initial float amount.",
  "frontend/src/features/cashregister/ClosingsHistoryList.tsx": "Displays a list of historical cash register closing records with timestamps, totals, and payment method breakdowns.",
  "frontend/src/features/cashregister/reporting.ts": "Utility functions for calculating payment method breakdowns (credit, debit, PIX) from sales data and filtering sales by session.",
  "frontend/src/features/customers/CustomerDetail.tsx": "Customer detail view showing customer info, total purchases, raffle eligibility status, and purchase history with items and payment methods.",
  "frontend/src/features/customers/CustomerFormDialog.tsx": "Dialog component for creating or editing a customer with name and phone fields, including form validation and loading states.",
  "frontend/src/features/customers/CustomersList.tsx": "Table component displaying a list of customers with view, edit, and delete action buttons for each row.",
  "frontend/src/features/inventory/ProductFilters.tsx": "Filter controls for products with a search input by name and a category dropdown selector.",
  "frontend/src/features/inventory/ProductFormDialog.tsx": "Dialog form for creating or editing products with fields for name, category, price, stock, and image upload with base64 conversion.",
  "frontend/src/features/inventory/ProductTable.tsx": "Memoized table component displaying products with images, details, low-stock badges, and edit/delete actions.",
  "frontend/src/features/pos/CartPanel.tsx": "Shopping cart display showing line items with quantity controls, remove buttons, and total calculation.",
  "frontend/src/features/pos/cartTypes.ts": "Defines CartItem type and utility functions for calculating line subtotals, cart totals, and converting cart items to sale items.",
  "frontend/src/features/pos/CheckoutPanel.tsx": "Checkout interface with payment method selection (PIX, Debit, Credit) and a complete sale button with processing state.",
  "frontend/src/features/pos/CustomerSelector.tsx": "React component for selecting a customer in POS, supporting search/filter with debouncing, pagination (50 items at a time), and options for 'Final Consumer' or specific customer selection.",
  "frontend/src/features/pos/draftSaleStorage.ts": "Manages localStorage persistence of draft POS sales (customer, cart items) with 24-hour expiration to prevent data loss on page refresh.",
  "frontend/src/features/pos/payment.ts": "Defines payment methods (PIX, Debit, Credit), validates cash payments, and calculates change with i18n support.",
  "frontend/src/features/pos/ProductPicker.tsx": "React component for browsing and selecting products in POS with search, category filtering, pagination (12 items), and stock/availability indicators; disabled until customer is selected.",
  "frontend/src/features/pos/RaffleEligibilityAlert.tsx": "Displays a trophy alert when sale total exceeds R$50.00 threshold to indicate raffle eligibility.",
  "frontend/src/features/pos/useCart.ts": "React hook managing cart state with add/update/remove operations, stock validation, error handling, and total calculation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches backend actor instances based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAppStore.ts": "Zustand store managing global app state (products, customers, sales, cash sessions) with CRUD operations and localStorage persistence; includes backend-driven setters for syncing with canister data.",
  "frontend/src/hooks/useAuthenticatedActor.ts": "Compositional hook combining Internet Identity authentication with actor initialization, returning null when unauthenticated and providing readiness flags to prevent anonymous backend calls.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces rapidly changing values with configurable delay (default 300ms) using setTimeout cleanup pattern.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations (customers, sales, cash register) with data mapping between frontend and backend types, including CRUD operations and query invalidation.",
  "frontend/src/i18n/ptBR.ts": "Portuguese (Brazil) localization strings for the entire application, including navigation, forms, validation messages, and category/payment method labels.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, focus states, and smooth transitions using a professional high-contrast color scheme.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CashRegisterPage.tsx": "Cash register management page with panels for opening/closing sessions and viewing closing history, syncing backend state to local store and calculating session totals from sales.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with list/detail views, search filtering, and CRUD operations using backend queries, including customer detail navigation and debounced search.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page that displays navigation cards for inventory, POS, customers, cash register, and sales history modules with icons and descriptions.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with product listing, search/filter by category, and CRUD operations using ProductTable, ProductFilters, and ProductFormDialog components.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity with loading states and error handling.",
  "frontend/src/pages/PosPage.tsx": "Point-of-sale page with product picker, cart management, customer selection, checkout flow, and draft sale persistence using local storage and backend queries.",
  "frontend/src/pages/SalesHistoryPage.tsx": "Sales history page displaying collapsible sale records with customer info, items, payment details, and admin-only delete functionality.",
  "frontend/src/storage/localStorageStore.ts": "LocalStorage persistence layer for app state (products, customers, sales, cash sessions) with versioning and migration support.",
  "frontend/src/types/domain.ts": "TypeScript domain model definitions for Product, Customer, Sale, SaleItem, CashSession, CashCloseRecord, and AppState.",
  "frontend/src/utils/image.ts": "Image processing utility that resizes, compresses, and converts images to base64 with size limits (500KB) for storage optimization.",
  "frontend/src/utils/money.ts": "Currency formatting and parsing utilities for Brazilian Real (BRL) using Intl.NumberFormat.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a multi-tenant POS system with Internet Identity isolation, documenting a known payment method classification bug where Pix and Debit sales are incorrectly saved as Credit, and listing pending feature requests to fix this issue."
}