{
  "backend/main.mo": "Main actor implementing a mini market POS system with customer management, inventory, sales tracking, cash register sessions, and role-based access control. Includes migration support and blob storage for product images.",
  "backend/migration.mo": "Migration module that converts old state with 3-variant PaymentMethod (pix, debito, credito) to new state with 4-variant PaymentMethod adding 'dinheiro' (cash) support.",
  "feature_evidence.json": "Feature evidence report documenting implementation of cash payment support across frontend payment types, checkout UI, change calculation interface, and cash register reporting.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering domain types, state management, payment processing with cash support, cart functionality, customer management, and inventory features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Mini Market Manager React application with viewport configuration and module script loading.",
  "frontend/PERFORMANCE_IMPROVEMENTS_REPORT.md": "Performance optimization report detailing Internet Identity authentication integration, authenticated actor hooks, render optimization with useCallback/useMemo, and elimination of unauthorized backend calls.",
  "frontend/src/App.tsx": "Main application component that manages page navigation, authentication state, and renders the header, footer, and current page (dashboard, inventory, POS, customers, cash register, or sales history).",
  "frontend/src/backend/mappers.ts": "Provides mapping utilities between frontend domain models and backend types, including currency conversion (BRL to cents), payment method mapping, and transformations for sales, customers, and cash register sessions.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper component that shows a loading screen during initialization, login page if unauthenticated, or renders children if authenticated.",
  "frontend/src/components/auth/AuthInitializingScreen.tsx": "Loading screen component displayed while the authentication system initializes, showing a shopping bag icon and spinner.",
  "frontend/src/features/cashregister/CashClosePanel.tsx": "Component for closing a cash register session, displaying initial float, sales total, payment method breakdown, and grand total with a close button.",
  "frontend/src/features/cashregister/CashOpenPanel.tsx": "Component for opening a new cash register session by entering an initial float amount, with validation and loading states.",
  "frontend/src/features/cashregister/ClosingsHistoryList.tsx": "Displays a list of past cash register closing records sorted by date, showing initial float, sales totals, and payment method breakdowns for each closing.",
  "frontend/src/features/cashregister/reporting.ts": "Utility functions for calculating payment method breakdowns from sales data and filtering sales by session ID.",
  "frontend/src/features/customers/CustomerDetail.tsx": "Detailed customer view showing total purchases, raffle eligibility status, and purchase history with items and payment methods.",
  "frontend/src/features/customers/CustomerFormDialog.tsx": "Dialog component for creating or editing a customer with name and phone fields, including form validation and loading states.",
  "frontend/src/features/customers/CustomersList.tsx": "Table component displaying a list of customers with view, edit, and delete action buttons for each row.",
  "frontend/src/features/inventory/ProductFilters.tsx": "Filter component providing search by product name and category dropdown selection for inventory filtering.",
  "frontend/src/features/inventory/ProductFormDialog.tsx": "Dialog form for creating or editing products with fields for name, category, price, stock, and image upload with base64 conversion.",
  "frontend/src/features/inventory/ProductTable.tsx": "Memoized table component displaying products with images, details, low-stock badges, and edit/delete actions.",
  "frontend/src/features/pos/CartPanel.tsx": "Shopping cart display component showing cart items with quantity controls, line subtotals, and total calculation.",
  "frontend/src/features/pos/cartTypes.ts": "Type definitions and utility functions for cart operations: CartItem interface, line subtotal calculation, cart total calculation, and conversion from cart items to sale items.",
  "frontend/src/features/pos/CheckoutPanel.tsx": "Checkout component handling payment method selection (PIX, Debit, Credit, Cash) with cash amount input and change calculation.",
  "frontend/src/features/pos/CustomerSelector.tsx": "React component for selecting a customer in POS, supporting search, debounced filtering, pagination (50 items at a time), and three selection modes: none, final-consumer, or specific customer.",
  "frontend/src/features/pos/draftSaleStorage.ts": "LocalStorage utilities for persisting draft POS sales (customer selection and cart items) to prevent data loss on page refresh, with 24-hour expiration.",
  "frontend/src/features/pos/payment.ts": "Payment method constants (PIX, Debit, Credit, Cash), validation for cash payments, change calculation, and re-export of payment method label helper.",
  "frontend/src/features/pos/ProductPicker.tsx": "React component for browsing and adding products to cart in POS, with search, category filtering, debounced search, pagination (12 items), stock warnings, and disabled state when no customer is selected.",
  "frontend/src/features/pos/RaffleEligibilityAlert.tsx": "Simple alert component that displays a trophy icon and eligibility message when sale total exceeds 50.0 threshold for raffle participation.",
  "frontend/src/features/pos/useCart.ts": "React hook managing cart state with add/update/remove/clear operations, stock validation, error handling, and total calculation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on Internet Identity authentication state, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useAppStore.ts": "Zustand store managing global app state (products, customers, sales, cash sessions) with CRUD actions, localStorage persistence, and backend-driven setters for synchronization.",
  "frontend/src/hooks/useAuthenticatedActor.ts": "Compositional hook combining Internet Identity authentication with backend actor initialization, returning null when unauthenticated and providing readiness flags to prevent anonymous calls.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic React hook that debounces a rapidly changing value with configurable delay (default 300ms) using setTimeout cleanup pattern.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations (customers, sales, cash register) with data mapping between frontend and backend types, including CRUD operations and list queries.",
  "frontend/src/i18n/ptBR.ts": "Portuguese (Brazil) localization strings for the entire application, including navigation, forms, validation messages, and display labels for categories and payment methods.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, focus states, and smooth transitions using a professional high-contrast color scheme.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CashRegisterPage.tsx": "Cash register management page with panels for opening/closing sessions and viewing closing history, syncing backend state with local store and calculating session totals from sales.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with list/detail views, search filtering, and CRUD operations using backend queries, including customer detail navigation and debounced search.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard landing page that displays a grid of navigation cards for inventory, POS, customers, cash register, and sales history modules.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with product listing, search/filter functionality, and dialogs for adding/editing/deleting products.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity with loading and error states.",
  "frontend/src/pages/PosPage.tsx": "Point-of-sale page with product picker, cart management, customer selection, checkout flow, and draft sale persistence using local storage.",
  "frontend/src/pages/SalesHistoryPage.tsx": "Sales history page displaying collapsible sale records with customer info, items, payment details, and admin-only delete functionality.",
  "frontend/src/storage/localStorageStore.ts": "LocalStorage persistence layer for app state including products, customers, sales, and cash sessions with versioning support.",
  "frontend/src/types/domain.ts": "TypeScript domain model definitions for Product, Customer, Sale, CashSession, CashCloseRecord, and AppState.",
  "frontend/src/utils/image.ts": "Image processing utility that resizes, compresses, and converts images to base64 with size limits for storage optimization.",
  "frontend/src/utils/money.ts": "Currency formatting and parsing utilities for Brazilian Real (BRL) using Intl.NumberFormat.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting existing features for cash payment support (backend types, UI buttons, change calculation, reporting) and pending feature requests for the Mini Market Manager application."
}