{
  "backend/main.mo": "Actor defining customer, sales, and cash‑register types plus CRUD and authorization‑guarded operations with in‑memory Maps.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend files and their roles in the app.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, themes, and base styles for light and dark modes.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app component managing page navigation and rendering pages including new Sales History.",
  "frontend/src/backend/mappers.ts": "Utility mappers converting frontend models to backend types and vice versa, including payment, sale, customer, and session mappings.",
  "frontend/src/features/cashregister/CashClosePanel.tsx": "Panel that summarizes current cash session totals and payment breakdown and triggers closing the register.",
  "frontend/src/features/cashregister/CashOpenPanel.tsx": "Panel to open a cash register session by entering an initial float and handling open state.",
  "frontend/src/features/cashregister/ClosingsHistoryList.tsx": "Displays a sorted list of past cash register closings with totals and payment method breakdowns.",
  "frontend/src/features/cashregister/reporting.ts": "Provides functions to calculate payment breakdowns from sales and filter sales by session.",
  "frontend/src/features/customers/CustomerDetail.tsx": "Shows customer info, raffle eligibility, and purchase history with detailed sale item breakdowns.",
  "frontend/src/features/customers/CustomerFormDialog.tsx": "Dialog form for creating or editing customers, managing name and phone fields.",
  "frontend/src/features/customers/CustomersList.tsx": "Table listing customers with actions to view, edit, or delete each entry.",
  "frontend/src/features/inventory/ProductFilters.tsx": "Search and category filter controls for filtering products in the inventory view.",
  "frontend/src/features/inventory/ProductFormDialog.tsx": "Form dialog for creating or editing products with fields for details and image upload.",
  "frontend/src/features/inventory/ProductTable.tsx": "Displays a table of products with images, stock warnings, and edit/delete actions.",
  "frontend/src/features/pos/CartPanel.tsx": "Shows cart items with quantity controls, subtotal per item, and total summary.",
  "frontend/src/features/pos/cartTypes.ts": "Defines cart item types and helpers for computing subtotals and sale item mappings.",
  "frontend/src/features/pos/CheckoutPanel.tsx": "Handles payment selection, cash validation, change calculation, and finalizing checkout.",
  "frontend/src/features/pos/CustomerSelector.tsx": "Dropdown component for optionally linking a customer to a sale.",
  "frontend/src/features/pos/payment.ts": "Provides payment method list and helpers for validating cash payments and calculating change.",
  "frontend/src/features/pos/ProductPicker.tsx": "Product search and filter UI allowing users to browse and add products to the cart.",
  "frontend/src/features/pos/RaffleEligibilityAlert.tsx": "Displays an alert when the sale total qualifies for a raffle entry.",
  "frontend/src/features/pos/useCart.ts": "React hook managing cart items, stock validation, and totals with add, update, remove, and clear functions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAppStore.ts": "Zustand store handling products, customers, sales, and cash sessions with localStorage persistence and update helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identities, handling login/logout, and exposing status flags.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend customers, sales, cash sessions, and mutations using actor and data mappers.",
  "frontend/src/i18n/ptBR.ts": "Portuguese localization strings and functions for UI labels, errors, and messages.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and accessibility-focused defaults.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/CashRegisterPage.tsx": "Manages cash register sessions, syncing backend data, opening/closing sessions, and displaying history.",
  "frontend/src/pages/CustomersPage.tsx": "Provides customer listing, creation, editing, and viewing, with dialogs and basic error handling.",
  "frontend/src/pages/DashboardPage.tsx": "Renders a dashboard with navigation cards linking to major app sections.",
  "frontend/src/pages/InventoryPage.tsx": "Displays and filters products, and handles creation, editing, and deletion via dialogs and store actions.",
  "frontend/src/pages/PosPage.tsx": "Implements POS flow including cart management, customer selection, and recording sales to backend.",
  "frontend/src/pages/SalesHistoryPage.tsx": "Shows a collapsible list of past sales with customer names, payment info, and totals.",
  "frontend/src/storage/localStorageStore.ts": "Loads, saves, and clears persistent app state in localStorage with versioning.",
  "frontend/src/types/domain.ts": "Defines TypeScript interfaces for products, customers, sales, cash sessions, and app state.",
  "frontend/src/utils/image.ts": "Provides a function to validate and convert images to base64 with a 500KB size limit.",
  "frontend/src/utils/money.ts": "Contains helpers to format numbers as BRL currency and parse currency strings to numbers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and layout settings with plugins.",
  "project_state.json": "Describes the project state, existing features, and pending requests related to adding a sales history screen."
}