{
  "backend/main.mo": "Main actor implementing a mini market POS system with customer management, sales tracking with cancellation/edit logging, inventory with blob storage, cash register sessions, and role-based access control using mixins.",
  "backend/migration.mo": "Migration module that transforms old Sale records (without status field) to new Sale records with a default status of #active during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: cancel sale button with confirmation, edit sale dialog, sales filter controls (active/cancelled/all), and exclusion of cancelled sales from financial reports.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including domain types with SaleStatus, Zustand store with backend integration, optimized components with memoization, authentication hooks, and Portuguese localization throughout the UI.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements using oklch color space.",
  "frontend/index.html": "HTML entry point for the Mini Market Manager React application with viewport meta tags and module script loading.",
  "frontend/PERFORMANCE_IMPROVEMENTS_REPORT.md": "Performance optimization report detailing Internet Identity authentication implementation, authenticated actor hooks to prevent unauthorized calls, and render optimizations using useCallback/useMemo across all major pages.",
  "frontend/src/App.tsx": "Root application component with page routing, AuthGate wrapper for authentication, logout functionality, sticky header with navigation, and Portuguese localization for the main UI shell.",
  "frontend/src/backend/mappers.ts": "Provides bidirectional mapping utilities between frontend domain models and backend types, including currency conversion (BRL to cents), payment method mapping, sale status mapping, and conversion functions for sales, customers, cash register sessions, and closing records.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate component that conditionally renders children if authenticated, shows a login page if not authenticated, or displays an initializing screen while loading stored identity.",
  "frontend/src/components/auth/AuthInitializingScreen.tsx": "Displays a loading screen with a shopping bag icon and spinner while the authentication system initializes.",
  "frontend/src/components/sales/SaleCancelDialog.tsx": "Alert dialog component for confirming sale cancellation with warnings about the action's effects (marking as cancelled, excluding from reports, maintaining audit trail) and a loading state during the operation.",
  "frontend/src/components/sales/SaleEditDialog.tsx": "Dialog component for editing a sale's payment method and item quantities, with validation to ensure quantities are positive and real-time total calculation.",
  "frontend/src/components/sales/SaleItemQuantityEditor.tsx": "Inline editor component for adjusting sale item quantities with increment/decrement buttons and direct input, displaying unit price and calculated subtotal.",
  "frontend/src/features/cashregister/CashClosePanel.tsx": "Panel component for closing a cash register session, displaying initial float, sales total, grand total, payment method breakdown, and a close button with loading state.",
  "frontend/src/features/cashregister/CashOpenPanel.tsx": "Panel component for opening a new cash register session by entering an initial float amount, with validation and loading state during the operation.",
  "frontend/src/features/cashregister/ClosingsHistoryList.tsx": "Displays a list of historical cash register closing records with session details, totals, payment method breakdowns, and cancelled sale counts, sorted by closing date.",
  "frontend/src/features/cashregister/reporting.ts": "Provides functions to calculate payment method breakdowns (PIX, debit, credit, cash) from active sales and filter sales by cash session ID.",
  "frontend/src/features/customers/CustomerDetail.tsx": "Displays detailed customer information including total purchases, raffle eligibility status, and purchase history with items and payment methods.",
  "frontend/src/features/customers/CustomerFormDialog.tsx": "Dialog component for adding or editing customer information (name and phone) with form validation and loading states.",
  "frontend/src/features/customers/CustomersList.tsx": "Table component that displays a list of customers with actions to view, edit, or delete each customer.",
  "frontend/src/features/inventory/ProductFilters.tsx": "Filter controls for products including search by name and category dropdown selection.",
  "frontend/src/features/inventory/ProductFormDialog.tsx": "Dialog form for adding or editing products with fields for name, category, price, stock, and image upload with base64 conversion.",
  "frontend/src/features/inventory/ProductTable.tsx": "Memoized table component displaying products with images, details, low stock badges, and edit/delete actions.",
  "frontend/src/features/pos/CartPanel.tsx": "Shopping cart UI displaying cart items with quantity controls, item removal, and total calculation.",
  "frontend/src/features/pos/cartTypes.ts": "Type definitions and utility functions for cart operations including CartItem interface, subtotal/total calculations, and conversion from cart items to sale items.",
  "frontend/src/features/pos/CheckoutPanel.tsx": "Checkout panel component for POS that handles payment method selection (PIX, Debit, Credit, Cash), validates cash payments, calculates change, and triggers sale completion with payment details.",
  "frontend/src/features/pos/CustomerSelector.tsx": "Customer selection component with search/filter functionality, debounced search, lazy loading of customers, and support for selecting individual customers or \"Final Consumer\" option.",
  "frontend/src/features/pos/draftSaleStorage.ts": "LocalStorage-based draft sale persistence to prevent data loss on page refresh, with 24-hour expiration and functions to save, load, and clear draft sales.",
  "frontend/src/features/pos/payment.ts": "Payment utilities including payment method constants, cash payment validation, change calculation, and payment method label helpers.",
  "frontend/src/features/pos/ProductPicker.tsx": "Product selection component with search, category filtering, debounced search, lazy loading, and displays product cards with stock status and add-to-cart functionality.",
  "frontend/src/features/pos/RaffleEligibilityAlert.tsx": "Alert component that displays a trophy icon and message when the sale total exceeds the raffle eligibility threshold of 50.0.",
  "frontend/src/features/pos/useCart.ts": "Custom React hook for cart state management with functions to add/update/remove items, validate stock availability, calculate totals, and handle error states.",
  "frontend/src/features/sales/SalesFilters.tsx": "Tab-based filter component for sales list allowing users to switch between active, cancelled, and all sales views.",
  "frontend/src/features/sales/salesUtils.ts": "Utility functions for filtering sales by status (active/cancelled/all), calculating active sales totals, and retrieving active sales from a list.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useAppStore.ts": "Zustand store managing app state (products, customers, sales, cash sessions) with CRUD actions and local storage persistence. Includes backward-compatible methods for customer/sale management that should use backend.",
  "frontend/src/hooks/useAuthenticatedActor.ts": "Compositional hook combining Internet Identity authentication with backend actor initialization, returning null actor when unauthenticated and providing readiness flags.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a rapidly changing value with configurable delay (default 300ms).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using @dfinity/auth-client, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API operations (customers, sales, cash register) using authenticated actor, with mappers converting between backend and frontend domain types.",
  "frontend/src/i18n/ptBR.ts": "Portuguese (pt-BR) localization strings for the entire application including navigation, forms, labels, error messages, and category/payment method translations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, focus states, and smooth transitions using oklch color space.",
  "frontend/src/main.tsx": "Application entry point wrapping App with QueryClientProvider and InternetIdentityProvider for React Query and authentication context.",
  "frontend/src/pages/CashRegisterPage.tsx": "Cash register management page that handles opening/closing register sessions, displays active sales, and shows closing history. Syncs register session, sales, and closing records with global app store.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with search, create, update, and view functionality. Includes debounced search filtering and displays customer details or list view based on selection state.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying navigation cards for inventory, POS, customers, cash register, and sales history modules. Each card triggers navigation to the respective page.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with product listing, filtering by search term and category, and CRUD operations. Uses global app store for product state management.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication integration. Displays loading states, error alerts, and branded login card interface.",
  "frontend/src/pages/PosPage.tsx": "Point-of-sale page with product picker, shopping cart, customer selection, checkout panel, and raffle eligibility. Includes draft sale persistence and restoration, validates cash register session, and records completed sales to backend.",
  "frontend/src/pages/SalesHistoryPage.tsx": "Sales history page component that displays sales records with expand/collapse functionality, filtering by status (active/cancelled/all), and actions for deleting, cancelling, and editing sales with confirmation dialogs.",
  "frontend/src/storage/localStorageStore.ts": "LocalStorage persistence layer that loads, saves, and clears application state (products, customers, sales, cash sessions) with versioning support for migration.",
  "frontend/src/types/domain.ts": "TypeScript domain type definitions for Product, Customer, Sale, SaleItem, CashSession, CashCloseRecord, and AppState with payment methods and sale status enums.",
  "frontend/src/utils/image.ts": "Image processing utility that resizes, compresses, and converts images to base64 format with size limits (500KB) and dimension constraints (800px) for storage optimization.",
  "frontend/src/utils/money.ts": "Currency formatting utilities for Brazilian Real (BRL) that format numbers to currency strings and parse currency strings back to numbers.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular URLs and hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/shadows/animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking implemented features (sale cancellation, editing, filtering) and pending feature requests (audit logs, stock reversal, status tracking) for a POS system."
}