{
  "kind": "build_request",
  "title": "Add a Sales History screen",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new Sales History screen that lists all recorded sales from the backend and makes them easy to review (date/time, customer, total, payment method, and change for cash payments), with each sale expandable to show item-by-item details (product name, quantity, unit price/subtotal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Sim, adicione uma tela de históricos de vendas"
        ]
      },
      "acceptanceCriteria": [
        "A new page component exists for Sales History and is reachable in the app UI.",
        "The page fetches sales via the existing React Query hook `useListSales()` and renders results without using local mocked data.",
        "Each sale row/card shows at least: timestamp (formatted), total amount, payment method label, and cash change when applicable.",
        "Expanding a sale reveals its line items with quantity and per-item totals/subtotals.",
        "The UI clearly handles loading and empty states."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add navigation to the Sales History screen from the Dashboard and from the app's page-switching logic in `frontend/src/App.tsx` (extend the `Page` union and `renderPage` switch accordingly).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Sim, adicione uma tela de históricos de vendas"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard includes a new card/menu option that navigates to the Sales History screen.",
        "`frontend/src/App.tsx` supports the new page key and correctly renders the Sales History page when selected.",
        "Returning to Dashboard via the existing header button works from the Sales History screen."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Extend the existing localization file `frontend/src/i18n/ptBR.ts` with the minimal new labels needed for the Sales History navigation and page headings, reusing existing helpers (e.g., payment method label and date formatting) where appropriate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Sim, adicione uma tela de históricos de vendas"
        ]
      },
      "acceptanceCriteria": [
        "New UI labels for the Sales History screen and its Dashboard menu entry are defined in `ptBR` and used by the new components (no hard-coded strings in the page where avoidable)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with logic in `backend/main.mo`.",
    "Do not edit files under `frontend/src/components/ui` (compose existing shadcn components instead).",
    "Do not modify immutable hook files: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Use English in this build request only; do not change the app language unless required for the new screen labels."
  ],
  "nonGoals": [
    "Do not add new backend endpoints or change the sales schema for this request.",
    "Do not implement real-time updates or websocket-based live sales feeds.",
    "Do not add export/printing features (CSV/PDF/receipt printing) as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}