{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Sales History screen (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a Sales History page that fetches and displays all backend sales with expandable line-item details and clear loading/empty states.",
      "acceptanceCriteria": [
        "A new page component exists for Sales History and is reachable in the app UI.",
        "The page fetches sales via the existing React Query hook `useListSales()` and renders results without using local mocked data.",
        "Each sale row/card shows at least: timestamp (formatted), total amount, payment method label, and cash change when applicable.",
        "Expanding a sale reveals its line items with quantity and per-item totals/subtotals.",
        "The UI clearly handles loading and empty states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SalesHistoryPage.tsx",
          "operation": "create",
          "description": "Implement Sales History page UI: fetch sales via `useListSales()` (no mocked data), format timestamps with `formatDateTimePtBR`, format amounts with `formatCurrency`, and label payment method with `getPaymentMethodLabel`. Also fetch customers via `useListCustomers()` to display customer name from `customerId`. Render each sale in a shadcn Card with an expandable section (e.g., details/summary or composed shadcn Collapsible/Accordion) showing item name, quantity, unit price, and line subtotal. Include explicit loading and empty states. Use existing shadcn-ui components (e.g., Card, Button, Separator, Badge) to compose the layout; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Wire Sales History into app navigation from Dashboard and App page-switching logic.",
      "acceptanceCriteria": [
        "Dashboard includes a new card/menu option that navigates to the Sales History screen.",
        "`frontend/src/App.tsx` supports the new page key and correctly renders the Sales History page when selected.",
        "Returning to Dashboard via the existing header button works from the Sales History screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Extend the `Page` union to include a Sales History page key (e.g., 'sales-history') and update `renderPage` switch to render the new `SalesHistoryPage` when selected. Ensure existing header Dashboard button continues to return to 'dashboard' from this screen."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Add a new Dashboard navigation card/menu item that calls `onNavigate` with the Sales History page key and uses new localized title/description labels. Compose the UI using existing shadcn-ui Card patterns already used in this file; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add minimal pt-BR localization labels required for Sales History navigation and headings, reusing existing helpers.",
      "acceptanceCriteria": [
        "New UI labels for the Sales History screen and its Dashboard menu entry are defined in `ptBR` and used by the new components (no hard-coded strings in the page where avoidable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/ptBR.ts",
          "operation": "modify",
          "description": "Add minimal new pt-BR labels for the Sales History feature (Dashboard card title/description and page heading/empty message as needed). Ensure the Sales History page uses these labels and continues to reuse existing helpers like `getPaymentMethodLabel` and `formatDateTimePtBR` where applicable."
        }
      ]
    }
  ]
}