{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix payment method classification bug (frontend changes)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Fix payment method mapping to ensure correct bidirectional conversion between frontend PaymentMethod enum values and backend string values without incorrect defaults",
      "acceptanceCriteria": [
        "The mapPaymentMethodToBackend function correctly maps PIX to 'pix', DEBIT to 'debito', and CREDIT to 'credito'",
        "The mapPaymentMethodFromBackend function correctly maps 'pix' to PIX, 'debito' to DEBIT, and 'credito' to CREDIT",
        "No mapping produces an incorrect default value"
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend/mappers.ts",
          "operation": "modify",
          "description": "Review and fix the mapPaymentMethodToBackend and mapPaymentMethodFromBackend functions to ensure accurate bidirectional mapping between frontend PaymentMethod enum (PIX, DEBIT, CREDIT) and backend string values ('pix', 'debito', 'credito'). Verify that no switch case or conditional uses an incorrect default that forces all values to 'credito'. Ensure the mapping is exhaustive and explicit for all three payment methods."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update sales report query logic to correctly group and aggregate sales by three distinct payment methods displaying separate totals",
      "acceptanceCriteria": [
        "The cash register closing report displays separate totals for Pix, Debit, and Credit sales",
        "Payment method grouping correctly identifies and sums sales by their stored payment method value",
        "The report accurately reflects the actual payment methods used in each sale"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/cashregister/reporting.ts",
          "operation": "modify",
          "description": "Review and fix the sales aggregation logic in reporting.ts to ensure payment method grouping correctly identifies and separates sales by 'pix', 'debito', and 'credito'. Verify that the grouping logic does not treat different payment methods as a single category and that totals are calculated independently for each method. Ensure the report accurately reflects the payment methods stored in each sale without any default consolidation."
        },
        {
          "path": "frontend/src/features/cashregister/CashClosePanel.tsx",
          "operation": "modify",
          "description": "Update the cash register closing panel UI to display separate totals for Pix, Debit, and Credit sales. Ensure the component uses the corrected reporting logic from reporting.ts and renders distinct line items or sections for each payment method with accurate totals. Verify that the displayed payment method labels match the backend values and user selections."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add payment method confirmation display in the sale summary section showing the selected payment method before completing the sale",
      "acceptanceCriteria": [
        "The checkout panel displays the selected payment method in the summary section",
        "The payment method label reads 'Payment: Pix', 'Payment: Debit', or 'Payment: Credit' based on user selection",
        "The confirmation is visible before the user completes the sale",
        "The displayed payment method matches the value that will be saved to the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/pos/CheckoutPanel.tsx",
          "operation": "modify",
          "description": "Add a payment method confirmation display in the sale summary section of CheckoutPanel.tsx that clearly shows 'Payment: [Selected Method]' before the user clicks the 'Complete Sale' button. Use the selected payment method from the component state and format it for display using localization helpers from i18n/ptBR.ts if available. Ensure the displayed value matches exactly what will be sent to the backend (PIX, DEBIT, or CREDIT from the frontend enum, which will be mapped to 'pix', 'debito', or 'credito'). Position the confirmation prominently in the summary area so users can verify their selection before finalizing the transaction."
        }
      ]
    }
  ]
}